#include "Controller/NinthLabMenu.h"

#include <locale>

int main() {
    setlocale(LC_ALL, "ru_RU.UT8-8");
    NinthLabMenu menu;
    // menu.init(
    //     {
    //         "Добавить стройматериал",
    //         "Добавить инструмент",
    //         "Создать заказ",
    //         "Добавить товар в заказ",
    //         "Оформить заказ",
    //         "Отменить заказ",
    //         "Показать каталог",
    //         "Показать заказы",
    //         "Изменить информацию о магазине",
    //         "Сохранить данные",
    //         "Демонстрация исключений"
    //     },
    //     "Девятая лабораторная работа"
    // );

    return 0;
}